Requests/CadastrarAtualizarOperacaoTransporte.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:tms="http://tmsfrete.v2.targetmp.com.br"
                  xmlns:arr="http://schemas.microsoft.com/2003/10/Serialization/Arrays"
                  xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header/>
    <soapenv:Body>
        <tms:CadastrarAtualizarOperacaoTransporte>
            <tms:auth>
                <tms:Usuario>setransportes.tms</tms:Usuario>
                <tms:Senha>Se@08289</tms:Senha>
                <tms:Token></tms:Token>
            </tms:auth>
            <tms:operacao>
                <tms:Instrucao>1</tms:Instrucao>
                <tms:IdOperacaoTransporte i:nil="true"/>
                <tms:CodigoCentroDeCusto></tms:CodigoCentroDeCusto>
                <tms:NCM>2302</tms:NCM>
                <tms:ProprietarioCarga>1</tms:ProprietarioCarga>
                <tms:PesoCarga>31480.0</tms:PesoCarga>
                <tms:TipoOperacao>1</tms:TipoOperacao>
                <tms:MunicipioOrigemCodigoIBGE>5203500</tms:MunicipioOrigemCodigoIBGE>
                <tms:MunicipioDestinoCodigoIBGE>4127700</tms:MunicipioDestinoCodigoIBGE>
                <tms:DataHoraInicio>2021-03-05T13:30:00</tms:DataHoraInicio>
                <tms:DataHoraTermino>2021-03-08</tms:DataHoraTermino>
                <tms:CPFCNPJContratado>02689189000105</tms:CPFCNPJContratado>
                <tms:ValorFrete>5351.6</tms:ValorFrete>
                <tms:ValorCombustivel>0.0</tms:ValorCombustivel>
                <tms:ValorPedagio>0.0</tms:ValorPedagio>
                <tms:ValorDespesas>0.0</tms:ValorDespesas>
                <tms:ValorImpostoSestSenat>0.0</tms:ValorImpostoSestSenat>
                <tms:ValorImpostoIRRF>0.0</tms:ValorImpostoIRRF>
                <tms:ValorImpostoINSS>0.0</tms:ValorImpostoINSS>
                <tms:ValorImpostoIcmsIssqn>0.0</tms:ValorImpostoIcmsIssqn>
                <tms:ParcelaUnica>false</tms:ParcelaUnica>
                <tms:ModoCompraValePedagio>4</tms:ModoCompraValePedagio>
                <tms:CategoriaVeiculo>11</tms:CategoriaVeiculo>
                <tms:NomeMotorista>SIRLENECAETANO DA SILVA</tms:NomeMotorista>
                <tms:CPFMotorista>05496726999</tms:CPFMotorista>
                <tms:RNTRCMotorista>0</tms:RNTRCMotorista>
                <tms:ItemFinanceiro></tms:ItemFinanceiro>
                <tms:Parcelas>
                    <tms:OperacaoTransporteParcelaRequest>
                        <tms:DescricaoParcela>SALDO DE FRETE</tms:DescricaoParcela>
                        <tms:Valor>1055.28</tms:Valor>
                        <tms:NumeroParcela>79018</tms:NumeroParcela>
                        <tms:DataVencimento>2021-03-08</tms:DataVencimento>
                        <tms:TipoDaParcela>3</tms:TipoDaParcela>
                        <tms:FormaPagamento>2</tms:FormaPagamento>
                        <tms:CartaoPagamento></tms:CartaoPagamento>
                        <tms:CodigoBanco>748</tms:CodigoBanco>
                        <tms:AgenciaDeposito>0715</tms:AgenciaDeposito>
                        <tms:ContaDeposito>85855-2</tms:ContaDeposito>
                        <tms:DigitoContaDeposito>0</tms:DigitoContaDeposito>
                        <tms:ProcessarAutomaticamente>true</tms:ProcessarAutomaticamente>
                        <tms:IdOperacaoTransporteParcela>0</tms:IdOperacaoTransporteParcela>
                        <tms:FlagContaPoupanca>false</tms:FlagContaPoupanca>
                        <tms:VariacaoContaPoupanca></tms:VariacaoContaPoupanca>
                        <tms:ItemFinanceiroParcela></tms:ItemFinanceiroParcela>
                    </tms:OperacaoTransporteParcelaRequest>
                    <tms:OperacaoTransporteParcelaRequest>
                        <tms:DescricaoParcela>ADIANTAMENTO</tms:DescricaoParcela>
                        <tms:Valor>4220.0</tms:Valor>
                        <tms:NumeroParcela>78549</tms:NumeroParcela>
                        <tms:DataVencimento>2021-03-08</tms:DataVencimento>
                        <tms:TipoDaParcela>1</tms:TipoDaParcela>
                        <tms:FormaPagamento>2</tms:FormaPagamento>
                        <tms:CartaoPagamento></tms:CartaoPagamento>
                        <tms:CodigoBanco>748</tms:CodigoBanco>
                        <tms:AgenciaDeposito>0715</tms:AgenciaDeposito>
                        <tms:ContaDeposito>85855-2</tms:ContaDeposito>
                        <tms:DigitoContaDeposito>0</tms:DigitoContaDeposito>
                        <tms:ProcessarAutomaticamente>true</tms:ProcessarAutomaticamente>
                        <tms:IdOperacaoTransporteParcela>0</tms:IdOperacaoTransporteParcela>
                        <tms:FlagContaPoupanca>false</tms:FlagContaPoupanca>
                        <tms:VariacaoContaPoupanca></tms:VariacaoContaPoupanca>
                        <tms:ItemFinanceiroParcela></tms:ItemFinanceiroParcela>
                    </tms:OperacaoTransporteParcelaRequest>
                </tms:Parcelas>
                <tms:Veiculos>
                    <tms:OperacaoTransporteVeiculoRequest>
                        <tms:Placa>AUQ7267</tms:Placa>
                        <tms:RNTRC>01751814</tms:RNTRC>
                    </tms:OperacaoTransporteVeiculoRequest>
                    <tms:OperacaoTransporteVeiculoRequest>
                        <tms:Placa>AZO8951</tms:Placa>
                        <tms:RNTRC>01751814</tms:RNTRC>
                    </tms:OperacaoTransporteVeiculoRequest>
                </tms:Veiculos>
                <tms:IdRotaModelo>217399</tms:IdRotaModelo>
                <tms:DeduzirImpostos>false</tms:DeduzirImpostos>
                <tms:TarifasBancarias>0.0</tms:TarifasBancarias>
                <tms:QuantidadeTarifasBancarias>8</tms:QuantidadeTarifasBancarias>
                <tms:IdIntegrador>OC.: 29552 - EMP.: 1 - AFT.: 1 987604079</tms:IdIntegrador>
                <tms:ValorDescontoAntecipado>76.32</tms:ValorDescontoAntecipado>
                <tms:CPFCNPJParticipanteDestinatario>01838723042202</tms:CPFCNPJParticipanteDestinatario>
                <tms:CPFCNPJParticipanteContratante></tms:CPFCNPJParticipanteContratante>
                <tms:CPFCNPJParticipanteSubcontratante></tms:CPFCNPJParticipanteSubcontratante>
                <tms:CPFCNPJParticipanteConsignatario></tms:CPFCNPJParticipanteConsignatario>
                <tms:NumeroLacreTransporteCombustivel></tms:NumeroLacreTransporteCombustivel>
                <tms:NumeroCartaoValePedagio>0</tms:NumeroCartaoValePedagio>
                <tms:DocumentoValePedagio></tms:DocumentoValePedagio>
                <tms:CEPOrigem>75570000</tms:CEPOrigem>
                <tms:CEPDestino>85900000</tms:CEPDestino>
                <tms:TipoCargaANTT>1</tms:TipoCargaANTT>
                <tms:DistanciaPercorrida>1142.0</tms:DistanciaPercorrida>
            </tms:operacao>
        </tms:CadastrarAtualizarOperacaoTransporte>
    </soapenv:Body>
</soapenv:Envelope>
